# Author: lindafang
# Date: 2020-05-22 11:52
# File: 5-9*9乘法表.py
'''
1*1=1
2*1=2 2*2=4
3*1=3 3*2=6 3*3=9
4*1=4 4*2=8 4*3=12 4*4=16
5*1=5 5*2=10 5*3=15 5*4=20 5*5=25
6*1=6 6*2=12 6*3=18 6*4=24 6*5=30 6*6=36
7*1=7 7*2=14 7*3=21 7*4=28 7*5=35 7*6=42 7*7=49
8*1=8 8*2=16 8*3=24 8*4=32 8*5=40 8*6=48 8*7=56 8*8=64
9*1=9 9*2=18 9*3=27 9*4=36 9*5=45 9*6=54 9*7=63 9*8=72 9*9=81

'''
# 需要几次循环？加数与被加数，加数一种变化，被加数还有变化
# 加数从1-9的变化，被加数从1到i
# 1---1；
# 2---1，2；
# 3--1，2，3；
# 抽象 i  j,  --> 1 到  j<=i

for i in range(1,10):
    for j in range(1,i+1):
        # 默认语句是换行的，加上end参数明确以空格结束
        # print(str(i)+"*"+str(j)+"="+str(i*j),end=" ")
        # 在里层打印会执行（1+2+3+...+9）所有
        # f是3.6以的用法
        print(f'{i}*{j}={i*j}',end=' ')
    #     什么都不加时print，表示换行，
    # 外层只运行外层的数9
    print()

# i从1-9，j是从1-i，步长1，打印输出
i=1
while i<=9:
    j=1
    while j<=i:
        print(f'{i}*{j}={i * j}', end=' ')
        j+=1
    print()
    i+=1


# while 与for可以嵌套

i=1
while i<=9:
    for j in range(1,i+1):
        print(f'{i}*{j}={i*j}',end=' ')
    print()
    i+=1
